{
  "config": {
    "abort": {
      "already_configured": "Cet appareil PhoneTrack est déjà configuré."
    },
    "error": {
      "invalid_url": "Format d'URL invalide. Veuillez fournir une URL HTTP/HTTPS valide.",
      "invalid_phonetrack_url": "L'URL doit être un point de terminaison API PhoneTrack 'getlastpositions'",
      "invalid_device_name": "Le nom de l'appareil ne peut pas être vide",
      "cannot_connect": "Impossible de se connecter à l'API PhoneTrack. Veuillez vérifier l'URL et la connexion réseau.",
      "device_not_found": "Appareil non trouvé dans PhoneTrack. Veuillez vérifier le nom de l'appareil.",
      "invalid_timeout_configuration": "Le délai d'expiration doit être au moins 2 fois l'intervalle d'interrogation pour éviter un comportement inattendu.",
      "unknown": "Une erreur inattendue s'est produite lors de la configuration"
    },
    "step": {
      "user": {
        "title": "Configurer PhoneTrack",
        "description": "Saisissez les informations API PhoneTrack pour suivre un appareil.",
        "data": {
          "url": "URL de l'API",
          "device_name": "Nom de l'appareil",
          "name": "Nom de l'intégration",
          "max_gps_accuracy": "Précision GPS maximale",
          "update_interval": "Intervalle de mise à jour (secondes)",
          "last_update_timeout": "Délai d'expiration de la dernière mise à jour (minutes, 0 pour désactiver)"
        },
        "data_description": {
          "url": "URL complète de l'API PhoneTrack incluant le jeton (ex. : https://&lt;serverurl&gt;/apps/phonetrack/api/getlastpositions/&lt;token&gt;).",
          "device_name": "Nom de l'appareil exactement tel qu'il apparaît dans PhoneTrack.",
          "name": "Nom convivial affiché pour cette intégration dans Home Assistant.",
          "max_gps_accuracy": "Précision GPS maximale en mètres (par défaut : 100). Les mises à jour avec une moins bonne précision seront ignorées.",
          "update_interval": "Fréquence d'interrogation de PhoneTrack pour de nouvelles positions, en secondes (par défaut : 60).",
          "last_update_timeout": "Marquer l'appareil comme indisponible après ce nombre de minutes sans mises à jour (par défaut : 0 - désactivé). AVERTISSEMENT : Définir sur 0 (désactivé) si votre application PhoneTrack n'envoie des mises à jour que lorsque l'appareil se déplace, sinon l'appareil peut apparaître incorrectement comme indisponible lorsqu'il est immobile. Activer uniquement si votre application envoie des mises à jour à intervalles réguliers."
        }
      }
    }
  }
}
